In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                       [np.nan, np.nan], [0.75, -1.3]],
                      index=['a', 'b', 'c', 'd'],
                      columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [3]:
# calling DataFrame's sum method returns a Series containing column sums:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [4]:
# Passing axis = 'columns' or axis=1 sums across the columns instead
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [5]:
# NA values are excluded unless the entire slice is NA
df.mean(axis='columns',skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

 Options for reduction methods
 ![ Options for reduction methods](./figs/5-7.jpg)

In [6]:
df.idxmax()

one    b
two    d
dtype: object

In [7]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [8]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [9]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Descriptive and summary statistics
![Descriptive and summary statistics](./figs/5-8.jpg)

### Correlation and Covariance

In [10]:
import pandas_datareader.data as web

In [11]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [12]:
returns = price.pct_change()

In [13]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-06-19 -0.002923  0.005133  0.003921 -0.001151
2019-06-20  0.008036  0.012912  0.009286  0.008246
2019-06-21 -0.003409  0.002521  0.000146  0.009411
2019-06-24 -0.001006  0.001078  0.005914 -0.005669
2019-06-25 -0.015158 -0.007104 -0.031572 -0.026149

In [14]:
returns['MSFT'].corr(returns['IBM'])

0.4870579333972049

In [15]:
returns['MSFT'].cov(returns['IBM'])

8.680743356886965e-05

In [16]:
returns.MSFT.corr(returns.IBM)

0.4870579333972049

In [17]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.375478  0.453145  0.457937
IBM   0.375478  1.000000  0.487058  0.403112
MSFT  0.453145  0.487058  1.000000  0.538028
GOOG  0.457937  0.403112  0.538028  1.000000

In [18]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000270  0.000076  0.000108  0.000116
IBM   0.000076  0.000152  0.000087  0.000077
MSFT  0.000108  0.000087  0.000209  0.000120
GOOG  0.000116  0.000077  0.000120  0.000239

In [19]:
returns.corrwith(returns.IBM)

AAPL    0.375478
IBM     1.000000
MSFT    0.487058
GOOG    0.403112
dtype: float64

In [20]:
returns.corrwith(volume)

AAPL   -0.059459
IBM    -0.156114
MSFT   -0.090037
GOOG   -0.020494
dtype: float64

### Unique Values, Value Counts, and Membership

In [21]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [22]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [23]:
 pd.value_counts(obj.values, sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [24]:
# isin performs a vectorized set membership
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [25]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [26]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [27]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

![Unique, value counts, and set membership methods](./figs/5-9.jpg)

In [28]:
 data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
   .....:                      'Qu2': [2, 3, 1, 2, 3],
   .....:                      'Qu3': [1, 5, 2, 4, 4]})

In [29]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [30]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0